slackGPT/issue_misc_error/15 DocIssuance_IssueMisc Request.xml

<soap-env:Envelope xmlns:soap-env="http://schemas.xmlsoap.org/soap/envelope/">
    <soap-env:Header>
        <ns0:MessageID xmlns:ns0="http://www.w3.org/2005/08/addressing">9b03f1d5-4cb5-4035-a202-d59d1299d204
        </ns0:MessageID>
        <ns1:Action xmlns:ns1="http://www.w3.org/2005/08/addressing">http://webservices.amadeus.com/TMDSIQ_15_1_1A
        </ns1:Action>
        <ns2:To xmlns:ns2="http://www.w3.org/2005/08/addressing">
            https://nodeD3.production.webservices.amadeus.com/1ASIWVPKVPK
        </ns2:To>
        <wsse:Session xmlns:wsse="http://xml.amadeus.com/2010/06/Session_v3" TransactionStatusCode="InSeries">
            <wsse:SessionId>0FG857CMY0</wsse:SessionId>
            <wsse:SequenceNumber>8</wsse:SequenceNumber>
            <wsse:SecurityToken>3UA5111BN9U891JW8ADD32MXX4</wsse:SecurityToken>
        </wsse:Session>
    </soap-env:Header>
    <soap-env:Body>
        <ns0:DocIssuance_IssueMiscellaneousDocuments xmlns:ns0="http://xml.amadeus.com/TMDSIQ_15_1_1A">
            <ns0:paxSelection>
                <ns0:passengerReference>
                    <ns0:type>PAX</ns0:type>
                    <ns0:value>2</ns0:value>
                </ns0:passengerReference>
            </ns0:paxSelection>
            <ns0:optionGroup>
                <ns0:switches>
                    <ns0:statusDetails>
                        <ns0:indicator>EXC</ns0:indicator>
                    </ns0:statusDetails>
                </ns0:switches>
            </ns0:optionGroup>
        </ns0:DocIssuance_IssueMiscellaneousDocuments>
    </soap-env:Body>
</soap-env:Envelope>
